modelCase/system/blockMeshDict

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;



vertices
(
    ( -150 -500 -150 )
    (  150 -500 -150 )
    (  150  500 -150 )
    ( -150  500 -150 )
    ( -150 -500  1000 )  // ← 여기서 Z 방향 최대값
    (  150 -500  1000 )
    (  150  500  1000 )
    ( -150  500  1000 )
);


blocks
(
    hex (0 1 2 3 4 5 6 7) (30 100 30) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    sides
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (2 3 7 6)
            (3 0 1 2)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

