modelCase/system/snappyHexMeshDict

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       false;

mergeTolerance 1e-6;

geometry
{
    pipe.stl
    {
        type triSurfaceMesh;
        name pipe;
    }
    pressure.stl
    {
        type triSurfaceMesh;
        name pressure;
    }
    thermowell.stl
    {
        type triSurfaceMesh;
        name thermowell;
    }
}

castellatedMeshControls
{
    maxLocalCells 1000000;
    maxGlobalCells 2000000;
    minRefinementCells 10;
    nCellsBetweenLevels 3;

    features
    (
        {
            file "pipe.eMesh";
            level 1;
        }
        {
            file "pressure.eMesh";
            level 1;
        }
        {
            file "thermowell.eMesh";
            level 1;
        }
    );

    refinementSurfaces
    {
        pipe
        {
            level (1 1);
        }
        pressure
        {
            level (1 1);
        }
        thermowell
        {
            level (1 1);
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {}

    locationInMesh (0 0 500); // STL 내부에 위치한 점으로 수정 필요
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
}

meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minVol 1e-13;
    minTetQuality 1e-9;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.02;
    minVolRatio 0.01;
    minTriangleTwist -1;

    nSmoothScale 4;
    errorReduction 0.75;
}

debug 0;

