modelCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          3000;
        startFace       263100;
    }
    outlet
    {
        type            patch;
        nFaces          3000;
        startFace       266100;
    }
    sides
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          7800;
        startFace       269100;
    }
)

// ************************************************************************* //
