modelCase/constant/momentumTransport

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}

simulationType  laminar;  // 또는 RASModel

momentumTransport
{
    transportModel  Newtonian;
    nu              nu [0 2 -1 0 0 0 0] 1e-06;
}

