modelCase/constant/physicalProperties

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}

viscosityModel  Newtonian;

nu              nu [0 2 -1 0 0 0 0] 1e-06;  // 동점성계수 (m²/s)
rho             rho [1 -3 0 0 0 0 0] 1000;  // 밀도 (kg/m³)

