modelCase/system/surfaceFeaturesDict

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version: 10                                     |
|   \\  /    A nd           | Web:      https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      surfaceFeaturesDict;
}


surfaces
(
    "pipe.stl"
    "pressure.stl"
    "thermowell.stl"
);

includedAngle 150;

extractionMethod    extractFromSurface;
writeObj            yes;

